# Pandas
https://dataitgirls2.github.io/10minutes2pandas/

In [7]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [8]:
s = pd.Series([1,3,5,np.nan, 6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [9]:
dates = pd.date_range('20180817', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  0.287951  1.971915  0.296604  0.511607
2013-01-02  0.545019  1.886220 -0.126159 -0.726710
2013-01-03  1.083948  0.999523  0.352386  0.363313
2013-01-04 -1.047061  0.189513  2.146556 -1.813896
2013-01-05 -1.162055 -0.404299  0.312939 -0.052832
2013-01-06 -1.128224 -0.614326 -0.585535  0.768870

In [11]:
df2 = pd.DataFrame({'A':1.,
                   'B': pd.Timestamp('20180817'),
                   'C': pd.Series(1, index=list(range(4)),dtype='float32'),
                   'D': np.array([3] * 4, dtype='int32'),
                   'E': pd.Categorical(['test', 'train', 'test', 'train']),
                   'F': 'foo'})
df2

     A          B    C  D      E    F
0  1.0 2018-08-17  1.0  3   test  foo
1  1.0 2018-08-17  1.0  3  train  foo
2  1.0 2018-08-17  1.0  3   test  foo
3  1.0 2018-08-17  1.0  3  train  foo

In [12]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.287951    0.545019    1.083948   -1.047061   -1.162055   -1.128224
B    1.971915    1.886220    0.999523    0.189513   -0.404299   -0.614326
C    0.296604   -0.126159    0.352386    2.146556    0.312939   -0.585535
D    0.511607   -0.726710    0.363313   -1.813896   -0.052832    0.768870

In [14]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.511607  0.296604  1.971915  0.287951
2013-01-02 -0.726710 -0.126159  1.886220  0.545019
2013-01-03  0.363313  0.352386  0.999523  1.083948
2013-01-04 -1.813896  2.146556  0.189513 -1.047061
2013-01-05 -0.052832  0.312939 -0.404299 -1.162055
2013-01-06  0.768870 -0.585535 -0.614326 -1.128224

In [15]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06 -1.128224 -0.614326 -0.585535  0.768870
2013-01-05 -1.162055 -0.404299  0.312939 -0.052832
2013-01-04 -1.047061  0.189513  2.146556 -1.813896
2013-01-03  1.083948  0.999523  0.352386  0.363313
2013-01-02  0.545019  1.886220 -0.126159 -0.726710
2013-01-01  0.287951  1.971915  0.296604  0.511607

In [16]:
df2 = df.copy()

In [17]:
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-01  0.287951  1.971915  0.296604  0.511607    one
2013-01-02  0.545019  1.886220 -0.126159 -0.726710    one
2013-01-03  1.083948  0.999523  0.352386  0.363313    two
2013-01-04 -1.047061  0.189513  2.146556 -1.813896  three
2013-01-05 -1.162055 -0.404299  0.312939 -0.052832   four
2013-01-06 -1.128224 -0.614326 -0.585535  0.768870  three

In [18]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-03  1.083948  0.999523  0.352386  0.363313   two
2013-01-05 -1.162055 -0.404299  0.312939 -0.052832  four

In [ ]:
ㅁ